code-review/NRB_3471_3546/База_Было/Documents/КорректировкаРеквизитовСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаРеквизитовСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/КорректировкаРеквизитовСчетаДепо/Ext/ObjectModule.bsl
// Проверка на существование документа созданного на основании
// переданного через параметр.
//
// Параметры
//  Основание  – Документ.Поручение
//                 
// Возвращаемое значение:
//   Булево.Истина   – если уже есть докумнт созданный на переданном основании.
//
Функция ПроверкаНаСозданныеДокументыНаОснованииТекщего(Основание)
	
		ЗапретРедактирования   = Ложь;
	
		ЗапретРедактирования = НЕ Документы.КорректировкаРеквизитовСчетаДепо.НайтиПоРеквизиту("ДокументОснование",Основание).Пустая();
			
		Если ЗапретРедактирования Тогда
			
			Возврат Истина;
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;
		
КонецФункции // ПроверкаНаСозданныеДокументыНаОснованииТекщего()

Процедура ОбработкаЗаполнения(Основание)
	
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		
		Если 	Основание.ВидОперацииД   = Справочники.ВидыОпераций.КорректировкаРеквизитовСчетаДепо   Тогда
						
			//проверка на существование документов введенных на основании текущего основания.	
			Если ПроверкаНаСозданныеДокументыНаОснованииТекщего(Основание) Тогда
				
				Проверка = Истина;
				Сообщить("На основании данного поручения уже есть введенный документ!!!");
				Возврат;
				
			КонецЕсли;
			Дата						= ОбщегоНазначения.ДатаДокумента(Основание);
			ДокументОснование 			= Основание.Ссылка;			
			ВладелецСчета 				= Основание.Инициатор;
			СчетДепо					= Основание.СчетДепо;
		Иначе
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ Корректировка реквизитов счета депо !!!");
			Возврат;	
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(
							Дата,
							Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПО.Код),7)),
							Новый Структура("Операция, МестоХранения1, МестоХранения2",Справочники.ВидыОпераций.КорректировкаРеквизитовСчетаДепо,Неопределено,Неопределено));
	Если РасчетныеПараметры <> Неопределено Тогда
		Движение = Движения.УслугиДепозитария.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Инициатор = ВладелецСчета;
		Движение.Услуга = РасчетныеПараметры.Услуга;
		Движение.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
		Движение.Валюта = РасчетныеПараметры.Валюта;
		Движение.Сумма = РасчетныеПараметры.Сумма;
		Движение.СуммаВВалюте = Конвертации.КонвертацияВалюты(Дата, Движение.Сумма, РасчетныеПараметры.Валюта);
		Движение.СуммаНДС = РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС, Движение.Сумма);
		Движение.СуммаВсего = РасчетТарифов.РТ_ОбщаяСумма(Движение.СтавкаНДС,Движение.Сумма,Движение.СуммаНДС);
		Движение.Сумма = Движение.СуммаВсего - Движение.СуммаНДС;
		Движение.ТипТарифа = РасчетныеПараметры.ТипТарифа;
		Движение.Тариф = РасчетныеПараметры.Тариф;
		Движения.УслугиДепозитария.Записать();
	КонецЕсли; 	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
#Если Клиент Тогда
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
